src/Catalogs/ШаблоныНаименований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ШаблоныНаименований</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНаименования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаименованийОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекурсивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляПредставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляФормирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыНаименованийОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыНаименованийОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ХарактеристикаРабочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХарактеристикаДляПечати</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураРабочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатураДляПечати</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/КатегорииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>КатегорииНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтавкиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортнаяАлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПоКлассификатору</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодОценкиЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствХарактеристики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьЗаполнениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаЗапасов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполненияЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатурыПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЦенника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПроизводителяВЕТИСПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗаписьСкладскогоЖурналаВЕТИСПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИдентификаторПартииВЕТИСПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДатуПроизводстваПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСрокГодностиПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиГенерироватьПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНомерПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПополнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПополненияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствСпецификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМаркировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМВид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМСпособВыпускаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыпускаВОборотГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМРазмер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазмерыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТНВЭДГИСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабачнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительИмпортерАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбувнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукцииИС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодакцизныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСерииНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолитикаУчетаСерий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолитикаУчетаСерий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныеНастройкиПолитикиУчетаСерий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСрокГодностиСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДатуПроизводстваСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьУказанияСрокаГодностиСерии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТочностиУказанияСрокаГодности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУникальныеСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствКомплектацииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСортировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныНаименований/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = Новый Структура;
	Настройки.Вставить("БулевскиеПараметры", Новый Массив);
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		Объект.Владелец = Справочники.КатегорииНоменклатуры.БезКатегории;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КатегорияНоменклатуры) Тогда
		Параметры.Свойство("КатегорияНоменклатуры", Объект.КатегорияНоменклатуры);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = ШаблоныНаименований.НаименованиеНезаполненногоШаблона();
	КонецЕсли;
	
	Если Параметры.Свойство("ДляХарактеристики") Тогда
		Объект.ДляХарактеристики = Параметры.ДляХарактеристики;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидНаименования) Тогда
		Параметры.Свойство("ВидНаименования", Объект.ВидНаименования);
	КонецЕсли;
	
	Если Объект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента Тогда
		НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов;
	ИначеЕсли Объект.ДляХарактеристики Тогда
		НаборСвойств = Объект.КатегорияНоменклатуры.НаборСвойствХарактеристики;
	Иначе
		НаборСвойств = Объект.КатегорияНоменклатуры.НаборСвойств;
	КонецЕсли;
	
	СоздатьКомандыДобавленияСвойств();
	ОбновитьПримерНаСервере();
	
	ПозицияКурсора = Новый Структура("НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки", 0, 0, 0, 0);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ЭтоПредопределенный Тогда
		ТекущийОбъект.ЭтоПредопределенный = (ТекущийОбъект.ШаблонДляПредставления = ШаблонПриОткрытии);
	КонецЕсли;
	
	ШаблоныНаименований.СформироватьНаименованиеШаблона(ТекущийОбъект);
	ОбновитьШаблонДляФормирования(Реквизиты, ТекущийОбъект.ШаблонДляПредставления, ТекущийОбъект.ШаблонДляФормирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ШаблоныНаименований");
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонДляПредставленияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("ОбновитьОтображениеФормы", 1.5, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура Подключаемый_КомандаВставитьПараметр(Команда)
	
	ПараметрИдентификатор = ПараметрИдентификатор(Команда.Имя);
	
	ДобавитьБлокВШаблон(, ПараметрИдентификатор);
	ПодключитьОбработчикОжидания("ОбновитьОтображениеФормы", 0.1, Истина);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКомандыДобавленияСвойств()
	
	// ИдентификаторПолный        - Внутреннее представление идентификатора для определения доп. реквизита.
	// ИдентификаторПредставление - Внешнее представление идентификатора для подстановки в шаблон (при записи заменяется на внутренний).
	// Представление              - Представление добавляемого параметра (используется в кнопках командной панели).
	// Заголовок                  - Заголовок сопутствующий параметру (добавляется в виде свободного текста перед значением параметра).
	
	НоваяСтрока = Реквизиты.Добавить();
	НоваяСтрока.ИдентификаторПолный = "Наименование";
	НоваяСтрока.ИдентификаторПредставление = "Наименование";
	НоваяСтрока.Представление = НСтр("ru='Наименование'");
	НоваяСтрока.Заголовок     = "";
	
	ШаблоныНаименованийСписокСвойств.Добавить("Наименование", НСтр("ru = 'Наименование'"));
	
	НоваяСтрока = Реквизиты.Добавить();
	НоваяСтрока.ИдентификаторПолный = "Артикул";
	НоваяСтрока.ИдентификаторПредставление = "Артикул";
	НоваяСтрока.Представление = НСтр("ru='Артикул'");
	НоваяСтрока.Заголовок     = "";
	
	ШаблоныНаименованийСписокСвойств.Добавить("Артикул", НСтр("ru = 'Артикул'"));
	
	Если Объект.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента Тогда
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Код";
		НоваяСтрока.ИдентификаторПредставление = "Код";
		НоваяСтрока.Представление = НСтр("ru='Код'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "НомерДоговора";
		НоваяСтрока.ИдентификаторПредставление = "НомерДоговора";
		НоваяСтрока.Представление = НСтр("ru='Номер договора'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ДатаНачала";
		НоваяСтрока.ИдентификаторПредставление = "ДатаНачала";
		НоваяСтрока.Представление = НСтр("ru='Дата начала (ДД.ММ.ГГГГ)'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ДатаОкончания";
		НоваяСтрока.ИдентификаторПредставление = "ДатаОкончания";
		НоваяСтрока.Представление = НСтр("ru='Дата окончания (ДД.ММ.ГГГГ)'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ДатаНачалаСокр";
		НоваяСтрока.ИдентификаторПредставление = "ДатаНачалаСокр";
		НоваяСтрока.Представление = НСтр("ru='Дата начала (ДД.ММ.ГГ)'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ДатаОкончанияСокр";
		НоваяСтрока.ИдентификаторПредставление = "ДатаОкончанияСокр";
		НоваяСтрока.Представление = НСтр("ru='Дата окончания  (ДД.ММ.ГГ)'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Организация";
		НоваяСтрока.ИдентификаторПредставление = "Организация";
		НоваяСтрока.Представление = НСтр("ru='Организация'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Валюта";
		НоваяСтрока.ИдентификаторПредставление = "Валюта";
		НоваяСтрока.Представление = НСтр("ru='Валюта'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "ВидДоговора";
		НоваяСтрока.ИдентификаторПредставление = "ВидДоговора";
		НоваяСтрока.Представление = НСтр("ru='Вид договора'");
		НоваяСтрока.Заголовок     = "";
		
		ШаблоныНаименованийСписокСвойств.Добавить("Код", НСтр("ru = 'ФР-01'"));
		ШаблоныНаименованийСписокСвойств.Добавить("НомерДоговора", НСтр("ru = 'НФ-0002'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ДатаНачала", "01.10.2014");
		ШаблоныНаименованийСписокСвойств.Добавить("СрокДействия", "19.10.2030");
		ШаблоныНаименованийСписокСвойств.Добавить("Владелец", НСтр("ru = '""Наша фирма""'"));
		ШаблоныНаименованийСписокСвойств.Добавить("ВалютаРасчетов", "RUB");
		ШаблоныНаименованийСписокСвойств.Добавить("ВидДоговора", НСтр("ru = 'с поставщиком'"));
		
	ИначеЕсли НЕ Объект.ДляХарактеристики Тогда
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Код";
		НоваяСтрока.ИдентификаторПредставление = "Код";
		НоваяСтрока.Представление = НСтр("ru='Код'");
		НоваяСтрока.Заголовок     = "";
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "СтранаПроисхождения";
		НоваяСтрока.ИдентификаторПредставление = "СтранаПроисхождения";
		НоваяСтрока.Представление = НСтр("ru='Страна происхождения'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'Страна происхождения'");
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = "Поставщик";
		НоваяСтрока.ИдентификаторПредставление = "Поставщик";
		НоваяСтрока.Представление = НСтр("ru='Поставщик'");
		НоваяСтрока.Заголовок     = НСтр("ru = 'Поставщик'");
		
		ШаблоныНаименованийСписокСвойств.Добавить("Артикул", "1234");
		ШаблоныНаименованийСписокСвойств.Добавить("Код", НСтр("ru = 'ФР-01'"));
		ШаблоныНаименованийСписокСвойств.Добавить("СтранаПроисхождения", НСтр("ru = 'Россия'"));
		ШаблоныНаименованийСписокСвойств.Добавить("Поставщик", НСтр("ru = 'ООО ""Наталья""'"));
		
	КонецЕсли;
	
	Для каждого ДопРеквизит Из НаборСвойств.ДополнительныеРеквизиты Цикл
		
		Если ДопРеквизит.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоБулевскийРеквизит = ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Булево"));
		
		НоваяСтрока = Реквизиты.Добавить();
		НоваяСтрока.ИдентификаторПолный = ДопРеквизит.Свойство;
		НоваяСтрока.ИдентификаторПредставление = ДопРеквизит.Свойство.Заголовок;
		НоваяСтрока.Представление = ДопРеквизит.Свойство.Заголовок;
		НоваяСтрока.Заголовок     = ?(ЭтоБулевскийРеквизит, "", ДопРеквизит.Свойство.Заголовок);
		
		Если ЭтоБулевскийРеквизит Тогда
			Настройки.БулевскиеПараметры.Добавить("[" + НоваяСтрока.ИдентификаторПолный + "]");
		КонецЕсли;
		
		Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
			Значения = Справочники.ЗначенияСвойствОбъектов.Выбрать(, ДопРеквизит.Свойство);
			Значения.Следующий();
			Значение = Значения;
		ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Число")) Тогда
			ГСЧ = Новый ГенераторСлучайныхЧисел;
			Значение = ГСЧ.СлучайноеЧисло(1, 30);
		ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Строка")) Тогда
			Значение = "<значение>";
		ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Булево")) Тогда
			Значение = ДопРеквизит.Свойство.Заголовок;
		ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ДопРеквизит.Свойство.ТипЗначения, Тип("Дата")) Тогда
			Значение = ТекущаяДатаСеанса();
		Иначе
			Значение = ДопРеквизит.Свойство.Заголовок;
		КонецЕсли;
		ШаблоныНаименованийСписокСвойств.Добавить(Строка(ДопРеквизит.Свойство), Значение);
		
	КонецЦикла;
	
	Реквизиты.Сортировать("Представление");
	
	СоздатьКомандыДобавленияПараметров();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКомандыДобавленияПараметров()
	
	Для Итератор = 0 По Реквизиты.Количество() - 1 Цикл
		
		Реквизит = Реквизиты[Итератор];
		
		НоваяКоманда = Команды.Добавить("КомандаВставитьПараметр" + Итератор);
		НоваяКоманда.Действие = "Подключаемый_КомандаВставитьПараметр";
		НоваяКоманда.Заголовок = Реквизиты[Итератор].Представление;
		
		НоваяКнопка = Элементы.Добавить("КомандаВставитьПараметр" + Итератор, Тип("КнопкаФормы"), Элементы.ГруппаДобавитьПараметр);
		НоваяКнопка.ИмяКоманды = "КомандаВставитьПараметр" + Итератор;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрИдентификатор(КомандаИмя)
	
	Возврат Число(СтрЗаменить(КомандаИмя, "КомандаВставитьПараметр", ""));
	
КонецФункции

&НаКлиенте
Процедура ДобавитьБлокВШаблон(БлокТекст = Неопределено, ПараметрИдентификатор = Неопределено)
	
	Если ПараметрИдентификатор <> Неопределено Тогда
		Параметр = "[" + Реквизиты[ПараметрИдентификатор].ИдентификаторПредставление + "]";
	Иначе
		Параметр = "";
	КонецЕсли;
	
	Если БлокТекст <> Неопределено Тогда
		Текст = "" + БлокТекст + " ";
		ПредопределенныйРазделитель = "";
	ИначеЕсли ПараметрИдентификатор <> Неопределено Тогда
		Текст = "" + Реквизиты[ПараметрИдентификатор].Заголовок;
		Если ЗначениеЗаполнено(Текст) Тогда
			Текст = Текст + " ";
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ШаблонДляПредставления) Тогда
			ПредопределенныйРазделитель = ", ";
		Иначе
			ПредопределенныйРазделитель = "";
		КонецЕсли;
	Иначе
		Текст = "";
		ПредопределенныйРазделитель = ", ";
	КонецЕсли;
	
	ТекстДляВставки = "{%1%2%3}";
	ТекстДляВставки = СтрШаблон(ТекстДляВставки, ПредопределенныйРазделитель, Текст, Параметр);
	
	СтрокаНач = 0;
	СтрокаКон = 0;
	КолонкаНач = 0;
	КолонкаКон = 0;
	Элементы.ШаблонДляПредставления.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	
	ПозицияНачалаВставки = ОпределитьПозициюВставкиТекста(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	ПозицияКонцаВставки = ПозицияНачалаВставки + СтрДлина(ТекстДляВставки);
	
	ПозицияКурсора.НачалоСтроки = СтрокаНач;
	ПозицияКурсора.НачалоКолонки = ПозицияКонцаВставки;
	ПозицияКурсора.КонецСтроки = СтрокаКон;
	ПозицияКурсора.КонецКолонки = ПозицияКонцаВставки;
	
	Текст = Объект.ШаблонДляПредставления;
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Объект.ШаблонДляПредставления = ТекстДляВставки;
	Иначе
		Объект.ШаблонДляПредставления = Лев(Текст, ПозицияНачалаВставки - 1) + ТекстДляВставки + Прав(Текст, СтрДлина(Текст) - ПозицияНачалаВставки + 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьПозициюВставкиТекста(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон)
	
	ТекущаяПозицияВСтроке = КолонкаНач;
	
	Если (ТекущаяПозицияВСтроке = СтрДлина(Объект.ШаблонДляПредставления) + 1) Тогда
		Возврат ТекущаяПозицияВСтроке;
	КонецЕсли;
	
	НачалоБлокаСлева = 0;
	КонецБлокаСлева = 0;
	Если ТекущаяПозицияВСтроке > 1 Тогда
		НачалоБлокаСлева = СтрНайти(Объект.ШаблонДляПредставления, "{", НаправлениеПоиска.СКонца, ТекущаяПозицияВСтроке - 1);
		КонецБлокаСлева = СтрНайти(Объект.ШаблонДляПредставления, "}", НаправлениеПоиска.СКонца, ТекущаяПозицияВСтроке - 1);
	КонецЕсли;
	
	НачалоБлокаСправа = СтрНайти(Объект.ШаблонДляПредставления, "{", НаправлениеПоиска.СНачала, ТекущаяПозицияВСтроке);
	КонецБлокаСправа = СтрНайти(Объект.ШаблонДляПредставления, "}", НаправлениеПоиска.СНачала, ТекущаяПозицияВСтроке);
	
	КурсорВБлоке = 
		ТекущаяПозицияВСтроке = НачалоБлокаСлева
		ИЛИ ТекущаяПозицияВСтроке = КонецБлокаСправа
		ИЛИ (
			НачалоБлокаСлева > КонецБлокаСлева 
			И ( 
				(НачалоБлокаСправа = 0 И КонецБлокаСправа <> 0) 
				ИЛИ КонецБлокаСправа < НачалоБлокаСправа
			)
		)
	;
	
	Если НЕ КурсорВБлоке Тогда
		Возврат ТекущаяПозицияВСтроке;
	КонецЕсли;
	
	ТекущаяПозицияВСтроке = КонецБлокаСправа + 1;
	Возврат ТекущаяПозицияВСтроке;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьШаблонДляФормирования(Реквизиты, ШаблонДляПредставления, ШаблонДляФормирования)
	
	ШаблонДляФормирования = ШаблонДляПредставления;
	
	Для каждого Реквизит Из Реквизиты Цикл
		
		ШаблонДляФормирования = СтрЗаменить(ШаблонДляФормирования, "[" + Реквизит.ИдентификаторПредставление + "]", "[" + Реквизит.ИдентификаторПолный + "]");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеФормы() Экспорт
	
	ОбновитьПример(Истина);
	УстановитьКурсорВПолеШаблона();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПример(ПолучитьПозициюКурсора = Ложь)
	
	Если ПолучитьПозициюКурсора Тогда
		Элементы.ШаблонДляПредставления.ПолучитьГраницыВыделения(
			ПозицияКурсора.НачалоСтроки,
			ПозицияКурсора.НачалоКолонки,
			ПозицияКурсора.КонецСтроки,
			ПозицияКурсора.КонецКолонки);
	Иначе
		ПозицияКурсора.НачалоСтроки = 0;
		ПозицияКурсора.НачалоКолонки = 0;
		ПозицияКурсора.КонецСтроки = 0;
		ПозицияКурсора.КонецКолонки = 0;
	КонецЕсли;
	
	Объект.ШаблонДляПредставления = Элементы.ШаблонДляПредставления.ТекстРедактирования;
	ОбновитьШаблонДляФормирования(Реквизиты, Элементы.ШаблонДляПредставления.ТекстРедактирования, Объект.ШаблонДляФормирования);
	НаименованиеПример = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(ШаблоныНаименованийСписокСвойств, Объект.ШаблонДляФормирования);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПримерНаСервере() Экспорт
	
	НаименованиеПример = ШаблоныНаименованийКлиентСервер.СформироватьНаименованиеПоШаблону(ШаблоныНаименованийСписокСвойств, Объект.ШаблонДляФормирования);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКурсорВПолеШаблона()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.НаименованиеПример;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШаблонДляПредставления;
	
	Если ЗначениеЗаполнено(Объект.ШаблонДляПредставления)
		И ПозицияКурсора.НачалоСтроки <> 0
		И ПозицияКурсора.НачалоКолонки  <> 0
		И ПозицияКурсора.КонецСтроки <> 0
		И ПозицияКурсора.КонецКолонки <> 0 Тогда
		Элементы.ШаблонДляПредставления.УстановитьГраницыВыделения(
			ПозицияКурсора.НачалоСтроки,
			ПозицияКурсора.НачалоКолонки,
			ПозицияКурсора.КонецСтроки,
			ПозицияКурсора.КонецКолонки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
